{
    "Introduction": {
        "id": 0,
        "name": "A Great Start",
        "description": "Teaching you the basics about Tap Tap Adventure!",
        "conversations": {
            "55": {
                "0": ["Hello there!", "It is my duty to introduce you to the realm of Maearth.",
                    "Also known as Tap Tap Adventure.", "Before we proceed, allow me to explain",
                    "The interface."
                ],

                "1": ["Click the sketchy character icon as the arrow indicates."],

                "2": ["Perfect, you are picking up quite quickly. Now let's continue!"],

                "3": ["Now click on the bag to open the inventory!"],

                "4": ["Splendid. That is as much as I can teach you about the interface.",
                    "Other instructors will cover different parts of the tutorial.",
                    "After all, I'm not that smart.", "Just remember one thing.. Follow the shells."],

                "12": ["Oh ummm.. I bet you weren't expecting to see me.", "So the archery instructor is sick, and I",
                    "have to cover for him.", "It's definitely not the creator's fault for running", "out of NPC sprites and using",
                    "me as a placeholder until he draws one.", "Anyway. Not exactly sure what I'm supposed to do but",
                    "Here. Take this bow and shoot a three skeletons."],

                "13": ["So whenever you're ready.. Equip the bow in your inventory",
                        "and shoot those spooky skeletons."],

                "14": ["Okay let's see. You still need to learn about potions..",
                      "and enchantments.. and the banks..",
                      "oh and bosses.. and other players..",
                      "and quantum entanglement.. and neural networks",
                      "and gradient descent.. and stochastic expansions..",
                      "So I'll just teleport you to your next stage..."]
            },

            "244": {
                "7": ["Oh, what do we have here.. A newbie -.-", "I suppose it is in the best of interest",
                    "to teach you about swords.", "-sigh- Take this sword and equip it."],

                "8": ["Equip the sword.."],

                "9": ["Great, at least you are not incapable of listening.",
                    "Your task is to kill 5 rats. Go now soldier."],

                "10": ["What are you waiting for? Kill 5 rats!"],

                "11": ["Well, I must admit, I am impressed.",
                    "But I still could do better.", "Either way. I am going to teleport you to your next area.",
                    "You still have a bit more to learn."]
            },

            "46": {
                "15": ["Hello there fellow adventurer!", "Wait what's that?"],
                "16": ["Oh no! It seems as the side-effects of fighting kicked in.", "Not to worry! I have the perfect antidote for that damage.",
                        "Here, take this potion and drink it!"],
                "17": ["Just press 1 on the keypad to drink the health.", "Or you could do it the old fashioned way by clicking the icon."],
                "18": ["Okay, phew. That was close.", "You must always watch your health in this world.", "You never know when you'll get one hit."]
            },

            "50": {
                "20": [":O", "O:"],
                "22": ["It's rare to see a human around here..", "I am the mysterious sorcerer who shall not be named",
                        "I will basically teach you about spells.", "But only for the sake of the tutorial.", "Oh since we're on that topic..",
                        "This is your last stage in your introduction!", "How does that make you feel?"],
                "24": ["Okay that's great!", "Now let's get to work.", "Firstly we gotta teach you how to load spells into your slots."],
                "25": ["The premise is simple, open your character menu.", "Shift screens and simply click on the spell."],

                "26": ["Okay perfect! Now simply click the spell and launch it at the rats!", "Or anywhere as a matter of fact..",
                        "Truthfully, I do not really care.. and I am", "definitely not skipping some conditionals because the",
                        "developer is being lazy and refuses to ensure you attack rats.", "But just launch the darn projectile already."],

                "27": ["Well, are you going to launch the projectile or not?"],
                "28": ["Oh my, you are truly one of the best wizards I have ever met.", "No I'm just kidding, I was programmed to say that",
                        "You're pretty mediocre, literally everyone that passes", "through here has to do the exact same thing so..",
                        "don't flatter yourself.", "Anyway, I suppose we are done here. I will be teleporting you away form here.",
                        "Best of luck on your endeavours adventurer, and do not forget..", "Follow the seashells when lost.."]
            }
        },
        "pointers": {
            "0": [0, 14, 554],
            "1": [3, 428, 206],
            "2": [0, 14, 554],
            "3": [3, 280, 206],
            "4": [0, 14, 554],
            "5": [0, 15, 561],
            "6": [0, 20, 25],
            "7": [0, 36, 535],
            "8": [3, 280, 206],
            "9": [0, 36, 535],
            "10": ["m"],
            "11": [0, 36, 535],
            "12": [0, 78, 40],
            "13": ["a"],
            "14": [0, 78, 40],
            "15": [0, 46, 18],
            "16": [0, 46, 18],
            "17": [3, 280, 206],
            "18": [0, 46, 18],
            "19": [0, 51, 17],
            "20": [0, 37, 497],
            "21": [0, 37, 497],
            "22": [0, 37, 497],
            "23": [0, 37, 497],
            "24": [0, 37, 497],
            "25": [3, 428, 206],
            "26": [0, 37, 497],
            "27": [3, 264, 206],
            "28": [0, 37, 497]
        },

        "doors": {
            "5": [15, 560],
            "6": [20, 24],
            "19": [51, 16]
        },

        "task": {
            "0": "talk",
            "1": "click",
            "2": "talk",
            "3": "click",
            "4": "talk",
            "5": "door",
            "6": "door",
            "7": "talk",
            "8": "60",
            "9": "talk",
            "10": "kill",
            "11": "talk",
            "12": "talk",
            "13": "kill",
            "14": "talk",
            "15": "talk",
            "16": "talk",
            "17": "35",
            "18": "talk",
            "19": "door",
            "20": "talk",
            "21": "talk",
            "22": "talk",
            "23": "talk",
            "24": "talk",
            "25": "skill",
            "26": "talk",
            "27": "spell",
            "28": "talk"
        }
    }
}